<?php

namespace Database\Seeders;

use App\Models\Area;
use App\Models\City;
use App\Models\Street;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class cities_areas_streets extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $areasByCity = [
            'مدينة زايد', 'الظفرة', 'العين', 'الرويس', 'الشهامة', 'بني ياس',
            'ديرة', 'البرشاء', 'السطوة', 'الكرامة', 'القصيص', '', 'جبل علي', 'الخوانيج', 'الورقاء',
           'المجاز', 'النهدة', 'القرائن', 'الخان', 'مويلح', 'اليرموك',
            'النعيمية', '', 'الجرف', 'الحميدية', 'الصوان',
            'الراشدية', 'الرميلة', 'المدام', 'فلج المعلا',
            'الجزيرة الحمراء', 'الرمس', 'خزام', 'الدقداقة', 'المعمورة',
            'قدفع', 'دبا الفجيرة', 'مربح', 'القرية', 'البدية',
        ];

        foreach ($areasByCity as $area) {
            DB::table('areas')->insert([
                'name' => $area,
                'created_at' => now(),
                'updated_at' => now(),
                'city_id' => 48,
            ]);
        }
        // }
        // $streets = [
        //     'الشيخ زايد', 'الاتحاد', 'المكتوم', 'حصة', 'الشيخ محمد بن زايد', 'الراشدية', 
        //     'البرشاء', 'الكرامة', 'القصيص', 'المنخول', 'ديرة', 'دبي مارينا', 'الخوانيج', 'العين',
        //     'الروضة', 'الورقاء', 'الجبل', 'المدينة', 'الطريق السريع', 'شارع الشيخ خليفة', 
        //     'شارع سيف', 'شارع الكورنيش', 'شارع الفلاح', 'شارع النخيل', 'شارع الشارقة', 'شارع المطار',
        //     'شارع جبل علي', 'شارع مدينة زايد', 'شارع الكرامة', 'شارع الفجيرة', 'شارع البطين', 
        //     'المدينة الصناعية', 'ميدان التحرير', 'البرج', 'المرر', 'الإعلام', 'الصحافة', 'الزاهية',
        //     'المجاز', 'أم القيوين', 'الرحمانية', 'الزاهية', 'مركز دبي التجاري', 'دبي فستيفال سيتي',
        //     'المعادي', 'الدمام', 'الميناء', 'خليج البحر', 'المؤسسة', 'الرحاب', 'الدوار', 'الجسر', 
        //     'شارع برج خليفة', 'العروبة', 'ابن بطوطة', 'الطريق الساحلي', 'الجزيرة الحمراء', 
        //     'القواسم', 'الملقا', 'الظفرة', 'المنطقة اللوجستية', 'الطريق السريع شمال', 'الراشدية', 
        //     'المدينة الزرقاء', 'الواحة', 'الظبيانية', 'الريم', 'الواحة الذهبية', 'صحراء دبي', 'البحث',
        //     'الطريق السريع', 'الراشدية 1', 'الشارقة الجديدة', 'الدوار', 'الصالحي', 'المحجوب', 'العين',
        //     'المطار', 'الطرائف', 'البستان', 'الصفا', 'الحي الريفي', 'المنتزه', 'الغابة', 'الرفاع',
        //     'المجري', 'المركز التجاري', 'المقر', 'الجسر القديم', 'المدينة القديمة', 'شواطئ البحر', 
        //     'دبي مول', 'الجزر', 'أمطار الإمارات', 'الحديقة العامة', 'الركاب', 'الطريق الأول', 'التلة',
        //     'مدينة الشباب', 'المدينة الرقمية', 'الشارقة الكبرى', 'ميدان النادي', 'النافورة', 'العين الصناعية',
        //     'الميناء القديم', 'الأسواق', 'الواحة', 'الجزيرة', 'دبي الجسر', 'المدينة العليا', 'الشلال', 
        //     'الساحة الرئيسية', 'سوق البحر', 'الوادي', 'المنطقة اللوجستية', 'الطريق الدولي', 'الطريق السريع جنوب',
        //     'الدوار الكبير', 'مركز الإمارات', 'القاعدة العسكرية', 'المطار الجنوبي', 'المنتجع السياحي', 
        //     'ميدان السياحة', 'الطريق الرئيسي', 'الحديقة الرياضية', 'المركز الثقافي', 'المنطقة التجارية',
        //     'الطريق الجديد', 'مركز المدينة', 'حدائق الشارقة', 'مركز الأعمال', 'المنطقة الصناعية 1', 'المنازل',
        //     'المدينة الهادئة', 'الحرم الجامعي', 'الشوارع القديمة', 'المدينة التعليمية', 'المنتجع الفندقي', 
        //     'الطريق السريع الشرقي', 'المدينة الساحلية', 'المنتجع السياحي', 'الحديقة العامة', 'طريق النقل العام',
        //     'المدينة الرقمية الحديثة', 'شارع القواسم', 'الشارقة القديمة', 'ميدان الشهداء', 'ميدان الصقر',
        //     'الشارع الأسود', 'المنطقة الجديدة', 'المنطقة السكنية', 'طريق النخيل', 'الطريق الرئيسي', 'مدينة الأطفال',
        //     'ساحة الخليج', 'المنطقة الحرة الجديدة', 'ميدان النهضة', 'ساحة المحطة', 'منتزه دبي', 'دبي الجديدة',
        //     'طريق مدينة الحرير', 'المنتجع الصحي', 'المنتجع', 'الشواطئ الرملية',
        // ];
        
        // foreach ($streets as $street) {
        //     DB::table('streets')->insert([
        //         'name' => $street,
        //         'created_at' => now(),
        //         'updated_at' => now(),
        //     ]);
        // }

    }
}
